package developerMaker;

public class Ending extends MainGame{

//	Ending(String name, int money, int hp, int intelligent, int stress, boolean state) {
//		super(name, money, hp, intelligent, stress, state);
//	}
	
	
	
	
		static void ending( Player play){
		
			//취업성공엔딩 > 이력서를 넣는다 and 지능 70이상일때
			if( play.intelligent >= 70 && resume == 1 && play.state == true ) {
				System.out.println("===================================================\n"
									+"[ENDING] 당신은 취업에 성공했습니다!\n"
									+"험난했지만 취업성공! Happy Ending\n"
									+"===================================================");
			}
			
			//이력서를 넣는다 and 지능 70이상 일때 and 상태아픔
			//직업도 얻고 병도 얻고 엔딩(취업에 성공했으나 병을 얻었다.)
			if( play.intelligent>=70 && resume == 1 && play.state == false ) {
				System.out.println("===================================================\n"
									+"[ENDING]취업에 성공했지만 병을 얻었다\n"
									+"직업도 얻고 병도 얻고 엔딩\n"
									+"===================================================");
			}
			
			//이력서를 넣는다 and 지능 70이하일때
			//취업실패엔딩&특수엔딩
			if( play.intelligent < 70 || resume == 2 ) {
				//이력서를 넣지않는다 or 취업실패시 and 각클래스 조건 충족시 나오는 엔딩
				//아르바이트를 10회 이상 진행시 정직원엔딩
				if( ArbeitCount == 10 ) {
					System.out.println("===================================================\n"
										+"[ENDING] 아르바이트 정직원이 되었다!\n"
										+"이력서를 넣지 않고 아르바이트 10회이상 달성시\n"
										+"===================================================");
				}
				//학교 10회이상 진행시 대학원 엔딩
				if( ShoolCount == 10 ) {
					System.out.println("===================================================\n"
										+"[ENDING] 대학원생이 되었다!\n"
										+"이력서를 넣지 않고 학교 10회이상 달성시\n"
										+"===================================================");
				}
				//집에서 휴식을 10회 이상 진행시 백수엔딩
				if( HomeCount == 10 ) {
					System.out.println("===================================================\n"
										+"[ENDING] 백수가 되었다. 욜로~\n"
										+"이력서를 넣지 않고 집에서 휴식 10회이상 달성시(백수엔딩)\n"
										+"===================================================");
				}
				
			}
			if( play.intelligent < 70 && resume == 1 ) {
			//지능 70이하 and 각클래스조건 미충족시
					//취준생엔딩(다시 준비하자!)
					System.out.println("===================================================\n"
										+"[ENDING]취업이 잘되지 않았다. 다시한번 도전 해보자\n"
										+"지능 70이하, 이력서 넣는다 선택시\n"
										+"===================================================");
				
			}
			if( play.intelligent < 70 && resume == 2){
				System.out.println("===================================================\n"
									+"[ENDING] 백수가 되었다. 욜로~\n"
									+"지능 70이하, 이력서를 넣지않는다 선택시\n"
									+"===================================================");
				
			}
			if( play.intelligent < 70 || resume == 2 && play.state == false ) {
				//입원엔딩(취업에 실패하고 병을 얻어 입원했다)
				System.out.println("===================================================\n"
									+"[ENDING] 몸이 너무아프다. 당분간 입원하게 되었다.\n"
									+"이력서를 넣지 않는다 or 지능 70이하 and 상태가 아픔일때\n"
									+"===================================================");
			}
	
	}




	

}
